# დავალება - 1 (კალკულატორი)

# კალკულატორის ფუნქცია მომხმარებლებს საშუალებას აძლევს შეასრულონ ძირითადი
# არითმეტიკული მოქმედებები (+, -, *, /). მომხმარებლებს შეუძლიათ შეიყვანონ ორი რიცხვი და
# შემდეგ აირჩიონ ოპერაცია შედეგის მისაღებად. კალკულატორი ასევე შეიცავს შეყვანის
# ვალიდაციას არასწორი შეყვანების დასამუშავებლად.


import os

# საქაღალდის და ფაილის შექმნა
folder = "project_1"
file = "calculator.py"

os.makedirs(folder, exist_ok=True)
file_name = os.path.join(folder, file)

calculator_code = """# კალკულატორის მათემატიკური ფუნქცია
def calculator (num1, num2, operator):

    # ოპერატორების ვალიდაცია
    if operator not in ["+", "-", "*", "/", "%", "**"]:
        return "შეცდომა, თქვენს მიერ შეყვანილია არასწორი ოპერატორი!"

    # 0-ზე გაყოფის ვალიდაცია
    if operator in ["/", "%"] and num2 == 0:
        return "შეცდომა, 0-ზე გაყოფა შეუძლებელია!"

    # ფუნქციის მათემატიკური მოქმედებები
    if operator == "+":
        return num1 + num2
    elif operator == "-":
        return num1 - num2
    elif operator == "*":
        return num1 * num2
    elif operator == "/":
        return num1 / num2
    elif operator == "%":
        return num1 % num2
    elif operator == "**":
        return num1 ** num2
    else:
        return "Invalid operator"

# მომხმარებლის მიერ შესაყვანი ინფორმაციის ფუნქცია
def user_input():

    # მომხმარებლის ინტერფეისისთვის კალკულატორის სათაურის დაბეჭდვა
    print ("=========== კალკულატორი ===========")

    # მომხმარებლის მიერ შესაყვანი ინფორმაციის ვალიდაციები
    try:
        # მომხმარებლის მიერ შესაყვანი პირველი რიცხვის ზედმეტი დროფების მოშორება და ათწილადად ქცევა
        num1 = float(input("შეიყვანეთ პირველი რიცხვი: ").strip())

        # მომხმარებლის მიერ სასურველი ოპერატორის შეყვანა და დროფების მოშორება
        operator = input("აირჩიეთ სასურველი ოპერაცია (+, -, *, /, %, **): ").strip()

        # მომხმარებლის მიერ შესაყვანი მეორე რიცხვის ზედმეტი დროფების მოშორება და ათწილადად ქცევა
        num2 = float(input("შეიყვანეთ მეორე რიცხვი: ").strip())

        # გამოძახება მათემატიკური ფუნქციის და ცვლადში შენახვა
        result = calculator(num1, num2, operator)

        # შემოწმება, თუ მიღებული რიცხვები მთელია აღარ დაბეჭდავს ათწილადად.
        if int(num1) == num1: num1 = int(num1)
        if int(num2) == num2: num2 = int(num2)
        if result == int(result): result = int(result)

        # ეკრანზე საბოლოო ტოლობის გამოტანა
        print(f"{num1} {operator} {num2} = {result}")

    except ValueError:
        # თუ მომხმარებელმა რიცხვის ნაცვლად ასოები შეიყვანა, float() აგდებს შეცდომას
        print("შეცდომა, გთხოვთ შეიყვანოთ მხოლოდ ციფრები!")

# მომხმარებლის მიერ შესაყვანი ფუნქციის გამოძახება
user_input()"""

# calculator.py ფაილში ჩაწერა მთელი იმ კოდს, რაც მოთავსებული იყო სამმაგ ბრჭყალებში
with open(file_name, "w", encoding="utf-8") as file:
    file.write(calculator_code)

###===============================================================================================================###

# დავალება 2 - თამაში 1 (გამოიცანით რიცხვი)

# ამ თამაშში პროგრამა აგენერირებს შემთხვევით რიცხვს მითითებული დიაპაზონიდან.
# მომხმარებლებს სთხოვენ გამოიცნონ რიცხვი. არასწორი რიცხვის შემთხვევაში პროგრამა
# მომხმარებელს აძლევს მინიშნებას (უფრო მაღალი/უფრო დაბალი). თამაში აკონტროლებს
# მცდელობების რაოდენობას და აჩვენებს შედეგს, როდესაც მომხმარებელი გამოიცნობს სწორ
# რიცხვს.

from random import randint

# საქაღალდის და ფაილის შექმნა
folder = "project_2"
file = "guess_the_number.py"

os.makedirs(folder, exist_ok=True)
file_name = os.path.join(folder, file)

guess_the_number_code = """from random import randint

# სამომხმარებლო ფუნქცია ვალიდაციისთვის
def guess_the_number(step, remaining_guesses, history):
    while True:
        try:
            # მომხმარებლის მიერ მონაცემების შემოტანა ტექსტურ ფორმატში
            user_input = (input(f"ცდა {step}, დარჩენილი გაქვთ {remaining_guesses} მცდელობა, გამოიცანი ჩაფიქრებული მთელი რიცხვი 1-დან 100-მდე: "))
            print ("===========================================================================================")
            print ()

            # ვამოწმებთ, ხომ არ არის შეყვანილი ველი ცარიელი
            if not user_input.strip():
                print ("შეცდომა, ველი ცარიელია, გთხოვთ შეიყვანოთ მთელი რიცხვი 1-დან 100-მდე!")
                print ()
                continue
            
            # მომხმარებლის მიერ შემოტანილი მონაცემის ტიპის გარდაქმნა ტექსტიდან მთელ რიცხვში
            number_value = int(user_input)

            # ვამოწმებთ, ხომ არ მეორდება რიცხვი ისტორიაში
            if number_value in history:
                print(f"შეცდომა, რიცხვი {number_value} უკვე შეიყვანეთ ადრე! იყავით ყურადღებით! მცდელობა არ დაგაკლდებათ!")
                print ()
                continue
            
            # ვამოწმებთ, ხომ არ სცილდება რიცხვი დასაშვებ დიაპაზონს
            if 1 <= number_value <= 100:
                return number_value
            else:
                print("შეცდომა, გთხოვთ შეიყვანოთ მთელი რიცხვი 1-დან 100-მდე!")
                print ()

        except ValueError:
            # თუ მომხმარებელი რიცხვის ნაცვლად შეიყვანს ტექსტს შეცდომის გამოტანა
            print("შეცდომა, გთხოვთ შეიყვანოთ მხოლოდ ციფრები!")
            print ()

# თამაშის მართვის ფუნქცია
def play_game():

    # კომპიუტერის მიერ ჩაფიქრებული შემთხვევითი რიცხვი
    secret_number = randint(1, 100)

    # მცდელობების მაქსიმალური რაოდენობა
    total_guesses = 8

    # მიმდინარე მცდელობის რაოდენობა
    i = 1

    # შეყვანილი რიცხვების ისტორია
    user_input_history = []

    print("თამაში დაიწყო! ჩაფიქრებულია რიცხვი 1-დან 100-მდე, აბა გამოიცანით...")
    print ()
    print(f"თქვენ გაქვთ სულ {total_guesses} მცდელობა!")
    print ()

    # ციკლის ოპერატორი
    while i <= total_guesses:
    
        # დარჩენილი მცდელობების გამოთვლა
        remaining_guesses = total_guesses - i

        # ვალიდაციის ფუნქციის გამოძახება
        guess = guess_the_number(i, remaining_guesses, user_input_history)

        # მიღებული მნიშვნელობის დამატება ისტორიაში
        user_input_history.append(guess)

        # პირობითი ოპერატორები
        if guess == secret_number:
            print(f"გილოცავთ,თქვენ გამოიცანით რიცხვი! ჩაფიქრებული რიცხვი იყო {secret_number}!")
            print ()
            print(f"თქვენი მცდელობების ისტორია: {user_input_history}")
            print ()

            # ციკლის შეწყვეტა მოგების შემთხვევაში
            break
        elif guess > secret_number:
            print("თქვენს მიერ შეყვანილი რიცხვი მეტია ჩაფიქრებულ რიცხვზე, გთხოვთ შეიყვანოთ უფრო ნაკლები რიცხვი!")
            print ()
        else:
            print ("თქვენს მიერ თქვენს მიერ შეყვანილი რიცხვი ნაკლებია ჩაფიქრებულ რიცხვზე, გთხოვთ შეიყვანოთ უფრო მეტი რიცხვი")
            print ()
        
        # მთვლელის გაზრდა
        i += 1

    else:
        # დასრულება ციკლის, როდესაც ციკლი ამოიწურება და break არ მოხდება

        print(f"სამწუხაროდ თქვენ დამარცხდით, ჩაფიქრებული რიცხვი იყო {secret_number}!")
        print ()

# თამაშის ფუნქციის გამოძახება
play_game()"""


# ფაილში ჩაწერა მთელი იმ კოდის, რაც მოთავსებული იყო სამმაგ ბრჭყალებში
with open(file_name, "w", encoding="utf-8") as file:
    file.write(guess_the_number_code)
