# კალკულატორის მათემატიკური ფუნქცია
def calculator (num1, num2, operator):

    # ოპერატორების ვალიდაცია
    if operator not in ["+", "-", "*", "/", "%", "**"]:
        return "შეცდომა, თქვენს მიერ შეყვანილია არასწორი ოპერატორი!"

    # 0-ზე გაყოფის ვალიდაცია
    if operator in ["/", "%"] and num2 == 0:
        return "შეცდომა, 0-ზე გაყოფა შეუძლებელია!"

    # ფუნქციის მათემატიკური მოქმედებები
    if operator == "+":
        return num1 + num2
    elif operator == "-":
        return num1 - num2
    elif operator == "*":
        return num1 * num2
    elif operator == "/":
        return num1 / num2
    elif operator == "%":
        return num1 % num2
    elif operator == "**":
        return num1 ** num2
    else:
        return "Invalid operator"

# მომხმარებლის მიერ შესაყვანი ინფორმაციის ფუნქცია
def user_input():

    # მომხმარებლის ინტერფეისისთვის კალკულატორის სათაურის დაბეჭდვა
    print ("=========== კალკულატორი ===========")

    # მომხმარებლის მიერ შესაყვანი ინფორმაციის ვალიდაციები
    try:
        # მომხმარებლის მიერ შესაყვანი პირველი რიცხვის ზედმეტი დროფების მოშორება და ათწილადად ქცევა
        num1 = float(input("შეიყვანეთ პირველი რიცხვი: ").strip())

        # მომხმარებლის მიერ სასურველი ოპერატორის შეყვანა და დროფების მოშორება
        operator = input("აირჩიეთ სასურველი ოპერაცია (+, -, *, /, %, **): ").strip()

        # მომხმარებლის მიერ შესაყვანი მეორე რიცხვის ზედმეტი დროფების მოშორება და ათწილადად ქცევა
        num2 = float(input("შეიყვანეთ მეორე რიცხვი: ").strip())

        # გამოძახება მათემატიკური ფუნქციის და ცვლადში შენახვა
        result = calculator(num1, num2, operator)

        # შემოწმება, თუ მიღებული რიცხვები მთელია აღარ დაბეჭდავს ათწილადად.
        if int(num1) == num1: num1 = int(num1)
        if int(num2) == num2: num2 = int(num2)
        if result == int(result): result = int(result)

        # ეკრანზე საბოლოო ტოლობის გამოტანა
        print(f"{num1} {operator} {num2} = {result}")

    except ValueError:
        # თუ მომხმარებელმა რიცხვის ნაცვლად ასოები შეიყვანა, float() აგდებს შეცდომას
        print("შეცდომა, გთხოვთ შეიყვანოთ მხოლოდ ციფრები!")

# მომხმარებლის მიერ შესაყვანი ფუნქციის გამოძახება
user_input()