from random import randint

# სამომხმარებლო ფუნქცია ვალიდაციისთვის
def guess_the_number(step, remaining_guesses, history):
    while True:
        try:
            # მომხმარებლის მიერ მონაცემების შემოტანა ტექსტურ ფორმატში
            user_input = (input(f"ცდა {step}, დარჩენილი გაქვთ {remaining_guesses} მცდელობა, გამოიცანი ჩაფიქრებული მთელი რიცხვი 1-დან 100-მდე: "))
            print ("===========================================================================================")
            print ()

            # ვამოწმებთ, ხომ არ არის შეყვანილი ველი ცარიელი
            if not user_input.strip():
                print ("შეცდომა, ველი ცარიელია, გთხოვთ შეიყვანოთ მთელი რიცხვი 1-დან 100-მდე!")
                print ()
                continue

            # მომხმარებლის მიერ შემოტანილი მონაცემის ტიპის გარდაქმნა ტექსტიდან მთელ რიცხვში
            number_value = int(user_input)

            # ვამოწმებთ, ხომ არ მეორდება რიცხვი ისტორიაში
            if number_value in history:
                print(f"შეცდომა, რიცხვი {number_value} უკვე შეიყვანეთ ადრე! იყავით ყურადღებით! მცდელობა არ დაგაკლდებათ!")
                print ()
                continue

            # ვამოწმებთ, ხომ არ სცილდება რიცხვი დასაშვებ დიაპაზონს
            if 1 <= number_value <= 100:
                return number_value
            else:
                print("შეცდომა, გთხოვთ შეიყვანოთ მთელი რიცხვი 1-დან 100-მდე!")
                print ()

        except ValueError:
            # თუ მომხმარებელი რიცხვის ნაცვლად შეიყვანს ტექსტს შეცდომის გამოტანა
            print("შეცდომა, გთხოვთ შეიყვანოთ მხოლოდ ციფრები!")
            print ()

# თამაშის მართვის ფუნქცია
def play_game():

    # კომპიუტერის მიერ ჩაფიქრებული შემთხვევითი რიცხვი
    secret_number = randint(1, 100)

    # მცდელობების მაქსიმალური რაოდენობა
    total_guesses = 8

    # მიმდინარე მცდელობის რაოდენობა
    i = 1

    # შეყვანილი რიცხვების ისტორია
    user_input_history = []

    print("თამაში დაიწყო! ჩაფიქრებულია რიცხვი 1-დან 100-მდე, აბა გამოიცანით...")
    print ()
    print(f"თქვენ გაქვთ სულ {total_guesses} მცდელობა!")
    print ()

    # ციკლის ოპერატორი
    while i <= total_guesses:

        # დარჩენილი მცდელობების გამოთვლა
        remaining_guesses = total_guesses - i

        # ვალიდაციის ფუნქციის გამოძახება
        guess = guess_the_number(i, remaining_guesses, user_input_history)

        # მიღებული მნიშვნელობის დამატება ისტორიაში
        user_input_history.append(guess)

        # პირობითი ოპერატორები
        if guess == secret_number:
            print(f"გილოცავთ,თქვენ გამოიცანით რიცხვი! ჩაფიქრებული რიცხვი იყო {secret_number}!")
            print ()

            # ციკლის შეწყვეტა მოგების შემთხვევაში
            break
        elif guess > secret_number:
            print("თქვენს მიერ შეყვანილი რიცხვი მეტია ჩაფიქრებულ რიცხვზე, გთხოვთ შეიყვანოთ უფრო ნაკლები რიცხვი!")
            print ()
        else:
            print ("თქვენს მიერ შეყვანილი რიცხვი ნაკლებია ჩაფიქრებულ რიცხვზე, გთხოვთ შეიყვანოთ უფრო მეტი რიცხვი")
            print ()

        # მთვლელის გაზრდა
        i += 1

    else:
        # დასრულება ციკლის, როდესაც ციკლი ამოიწურება და break არ მოხდება

        print(f"სამწუხაროდ თქვენ დამარცხდით, ჩაფიქრებული რიცხვი იყო {secret_number}!")
        print ()

# თამაშის ფუნქციის გამოძახება
play_game()